In [35]:
import pandas as pd
import psycopg2

In [36]:
# First Dataset
big_cheddar_csv = "Resources/big_cheddar.csv"
big_cheddar_df = pd.read_csv(big_cheddar_csv)
big_cheddar_df.head(15)

   Week Ending Date Report Date   Date  Weighted Prices       Sales
0        08/19/2017  08/23/2017  07/22           1.5907  11,217,751
1        08/19/2017  08/23/2017  07/29           1.6226  11,933,852
2        08/19/2017  08/23/2017  08/05           1.6822  11,874,522
3        08/19/2017  08/23/2017  08/12           1.7376  11,228,718
4        08/19/2017  08/23/2017  08/19           1.7429  12,414,048
5        08/12/2017  08/16/2017  08/12           1.7375  10,981,870
6        08/12/2017  08/16/2017  08/05           1.6822  11,874,522
7        08/12/2017  08/16/2017  07/29           1.6226  11,933,852
8        08/12/2017  08/16/2017  07/22           1.5907  11,217,751
9        08/12/2017  08/16/2017  07/15           1.5866  14,121,953
10       08/05/2017  08/09/2017  07/08           1.6113  12,066,404
11       08/05/2017  08/09/2017  07/15           1.5866  14,121,953
12       08/05/2017  08/09/2017  07/22           1.5907  11,217,751
13       08/05/2017  08/09/2017  07/29           1.6226  11,933,852
14       08/05/2017  08/09/2017  08/05           1.6813  11,698,761

In [37]:
clean_cheese_df = big_cheddar_df

In [38]:
# Second Dataset
bigger_cheddar_df = pd.read_csv('Resources/bigger_cheddar.csv')
bigger_cheddar_df.head()

,Week Ending Date,Report Date,Date,Weighted Price,Weighted Price adjusted to 38% moisture,Sales,Moisture Content
0,08/19/2017,08/23/2017,07/22,1.5238,1.4489,"9,233,624",34.79
1,08/19/2017,08/23/2017,07/29,1.5636,1.4863,"10,948,266",34.77
2,08/19/2017,08/23/2017,08/05,1.5891,1.5113,"11,520,370",34.81
3,08/19/2017,08/23/2017,08/12,1.6360,1.5526,"10,741,788",34.67
4,08/19/2017,08/23/2017,08/19,1.6543,1.5738,"11,131,479",34.83

In [39]:
bigger_cheddar_df = bigger_cheddar_df[['Date','Weighted Price', 'Weighted Price adjusted to 38% moisture', 'Sales', 'Moisture Content']].copy()
bigger_cheddar_df.head()

,Date,Weighted Price,Weighted Price adjusted to 38% moisture,Sales,Moisture Content
0,07/22,1.5238,1.4489,"9,233,624",34.79
1,07/29,1.5636,1.4863,"10,948,266",34.77
2,08/05,1.5891,1.5113,"11,520,370",34.81
3,08/12,1.6360,1.5526,"10,741,788",34.67
4,08/19,1.6543,1.5738,"11,131,479",34.83

In [40]:
big_c = bigger_cheddar_df

In [53]:
clean_cheese_df = pd.DataFrame({"40 & 500 LB CHEESE":big_c.groupby(['Date', 'Sales'])["Weighted Price"].mean()})

In [42]:
clean_cheese_df.head()

                  40 LB CHEESE
Date  Sales
01/02 8,636,161         1.5569
      8,839,183         1.5586
      9,167,653         1.5586
01/03 9,122,463         1.6474
01/04 10,364,785        2.0600

In [46]:
# Third Data set
whole_df= pd.read_csv('Resources/Wholesale_data.csv')
whole_df.head(10)

,Channel,Region,Fresh,Milk,Grocery,Frozen,Detergents_Paper,Delicassen
0,2,3,12669,9656,7561,214,2674,1338
1,2,3,7057,9810,9568,1762,3293,1776
2,2,3,6353,8808,7684,2405,3516,7844
3,1,3,13265,1196,4221,6404,507,1788
4,2,3,22615,5410,7198,3915,1777,5185
5,2,3,9413,8259,5126,666,1795,1451
6,2,3,12126,3199,6975,480,3140,545
7,2,3,7579,4956,9426,1669,3321,2566
8,1,3,5963,3648,6192,425,1716,750
9,2,3,6006,11093,18881,1159,7425,2098

In [47]:
whole_df = whole_df[["Fresh","Milk","Grocery","Frozen","Detergents_Paper","Delicassen"]]
whole_df.head(10)

   Fresh   Milk  Grocery  Frozen  Detergents_Paper  Delicassen
0  12669   9656     7561     214              2674        1338
1   7057   9810     9568    1762              3293        1776
2   6353   8808     7684    2405              3516        7844
3  13265   1196     4221    6404               507        1788
4  22615   5410     7198    3915              1777        5185
5   9413   8259     5126     666              1795        1451
6  12126   3199     6975     480              3140         545
7   7579   4956     9426    1669              3321        2566
8   5963   3648     6192     425              1716         750
9   6006  11093    18881    1159              7425        2098

In [50]:
whole_df = whole_df.rename(columns={"Fresh":"Produce","Milk":"Dairy","Delicassen":"Deli"})
whole_df.head(10)

   Produce  Dairy  Grocery  Frozen  Detergents_Paper  Deli
0    12669   9656     7561     214              2674  1338
1     7057   9810     9568    1762              3293  1776
2     6353   8808     7684    2405              3516  7844
3    13265   1196     4221    6404               507  1788
4    22615   5410     7198    3915              1777  5185
5     9413   8259     5126     666              1795  1451
6    12126   3199     6975     480              3140   545
7     7579   4956     9426    1669              3321  2566
8     5963   3648     6192     425              1716   750
9     6006  11093    18881    1159              7425  2098

In [ ]:
file_df_new = pd.dataFrame({"":file_df.groupby(["",""])[""].mean(),
      "40 LB CHEESE":file_df.groupby(["Date","Sales"]["Weighted Price"].sum()})                     })

In [ ]:
file_df_new.head()

In [ ]:
#MERGING DATA
merged = pd.merge(clean_cheese_df,file_df_new, on=["",""],how="inner")

In [ ]:
merged.head()

In [ ]:
merged2 = pd.merge(merged,file_df_new, on=["",''],how="inner")

In [ ]:
merged2.head()

In [ ]:
merged_final = merged2.reset_index()

In [ ]:
merged_final.head()

In [ ]:
merged_final = merged_final[["","","","","","","",""]]

In [54]:
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [55]:
rds_connection_string = "postgres:2245Joey@localhost:5432/etl_project"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [56]:
engine.table_names()

[]

In [58]:
whole_df.to_sql(name='Dairy', con=engine, if_exists='append', index=False)

In [ ]:
merged_final_sql = merged_final.rename(columns={"":"","":"","":"","":
                                               "","":""})

In [ ]:
merged_final_sql.head()

In [ ]:
merged_final_sql.to_sql(name='', con=engine, if_exists='append', index=False)